palp/qmk_firmware/tmk_core/protocol/arm_atsam/usb/udi_hid_kbd.c
bool udi_hid_lamparray_setup(void) { return udi_hid_setup(&udi_hid_lamparray_rate, &udi_hid_lamparray_protocol, (uint8_t *)&udi_hid_lamparray_report_desc, udi_hid_lamparray_setreport); }

uint8_t udi_hid_lamparray_getsetting(void) { return 0; }

static bool udi_hid_lamparray_setreport(void) {
    if (Udd_setup_is_out()) {
        switch (udd_g_ctrlreq.req.wValue >> 8) {
            case USB_HID_REPORT_TYPE_FEATURE: {
                uint8_t report_id = (udd_g_ctrlreq.req.wValue & 0xFF);
                if (report_id < 1 || report_id > HID_LAMPARRAY_REPORTS)
                    return false;
                if (udi_hid_lamparray_report_size[report_id-1] <= udd_g_ctrlreq.req.wLength) {
                    udd_g_ctrlreq.payload = udi_hid_lamparray_report_set;
                    udd_g_ctrlreq.callback = udi_hid_lamparray_setreport_valid;
                    udd_g_ctrlreq.payload_size = udi_hid_lamparray_report_size[report_id-1];
                    return true;
                }
                default:
                    return false;
            }
        }
    } else {
        switch (udd_g_ctrlreq.req.wValue >> 8) {
            case USB_HID_REPORT_TYPE_FEATURE: {
                uint8_t report_id = (udd_g_ctrlreq.req.wValue & 0xFF);
                if (report_id < 1 || report_id > HID_LAMPARRAY_REPORTS)
                    return false;
                switch (report_id) {
                    case 1:
                        udd_g_ctrlreq.payload = hid_lamparray_attributes_report.raw;
                        udd_g_ctrlreq.payload_size = HID_LAMPARRAY_ATTRIBUTES_REPORT_SIZE;
                        udd_g_ctrlreq.callback = udi_hid_lamparray_getreport_valid;
                        return true;
                    case 3:
                        if (udi_hid_lamparray_report_index >= DRIVER_LED_TOTAL)
                            udi_hid_lamparray_report_index = 0;
                        hid_lamparray_attributes_response_report.desc.lamp_id = udi_hid_lamparray_report_index;
                        fill_lamp_attributes(&hid_lamparray_attributes_response_report.desc);
                        udd_g_ctrlreq.payload = hid_lamparray_attributes_response_report.raw;
                        udd_g_ctrlreq.payload_size = HID_LAMPARRAY_ATTRIBUTES_RESPONSE_REPORT_SIZE;
                        udd_g_ctrlreq.callback = udi_hid_lamparray_getreport_valid;
                        udi_hid_lamparray_report_index++;
                        return true;
                    default:
                        return false;
                }
            }
        }
    }
    return false;
}

static void udi_hid_lamparray_getreport_valid(void) {}

static void udi_hid_lamparray_setreport_valid(void) {
    if (udi_hid_lamparray_report_set[0] == 2) {
        udi_hid_lamparray_report_index = udi_hid_lamparray_report_set[1];
        return;
    }
    UDI_HID_LAMPARRAY_RECEIVE(udi_hid_lamparray_report_set, udd_g_ctrlreq.payload_size);
}

#endif // HID_LAMPARRAY_ENABLE
